Exercise9/exercise9.tex
% Created 2016-04-26 ti. 13:31
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Sindre Hansen}
\date{\today}
\title{Exercise 9}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Task 1}
\label{sec-1}
\subsection{Why do we assign priorities to tasks?}
\label{sec-1-1}
We assign priorities to establish a hierarchy of importance. Processes that pertain to the OS, kernel, etc should have a higher priority than user-generated processes.

\subsection{What features must a scheduler have for it to be usable for real-time systems?}
\label{sec-1-2}
For a scheduler to be useful in analysis of the system it needs to be predictable.

\section{Task 2}
\label{sec-2}
\subsection{Without priority inheritance}
\label{sec-2-1}
\begin{center}
\begin{tabular}{lrrrrlrrrrrrlllr}
Task & 0 & 1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & 9 & 10 & 11 & 12 & 13 & 14\\
\hline
a &  &  &  &  & E &  &  &  &  &  &  & Q & V & E & \\
b &  &  & E & V &  & V & E & E & E &  &  &  &  &  & \\
c & E & Q &  &  &  &  &  &  &  & Q & Q &  &  &  & E\\
\end{tabular}
\end{center}

\subsection{With priority inheritance}
\label{sec-2-2}
\begin{center}
\begin{tabular}{lrrrrlrrlrllrrrr}
Task & 0 & 1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & 9 & 10 & 11 & 12 & 13 & 14\\
\hline
a &  &  &  &  & E &  &  & Q &  & V & E &  &  &  & \\
b &  &  & E & V &  &  &  &  & V &  &  & E & E & E & \\
c & E & Q &  &  &  & Q & Q &  &  &  &  &  &  &  & E\\
\end{tabular}
\end{center}

\section{Task 3}
\label{sec-3}
\subsection{Priority inversion}
\label{sec-3-1}
\subsubsection{What is priority inversion?}
\label{sec-3-1-1}
If a high-priority task and a low-priority task shares the same resource, the high-priority task can end up waiting for the low-priority task, this is called priority inversion.
\subsubsection{What is unbounded priority inversion?}
\label{sec-3-1-2}
Unbounded priority inversion is when another task is preventing the low-priority task from releasing the resource, and the high-priority task ends up waiting forever.

\subsection{Does priority inheritance avoid deadlocks?}
\label{sec-3-2}
Priority inheritance does not prevent deadlocks.

\section{Task 4}
\label{sec-4}
\subsection{The simple task model}
\label{sec-4-1}
Assumptions:
\begin{itemize}
\item Tasks that are periodic, and with known times.
\item A fixed set of tasks
\item No overhead
\item Independent tasks
\end{itemize}
Most of these fairly realistic, but some require some workaround.

\subsection{Utilization test}
\label{sec-4-2}
For the task set to be schedulable \( U \leq n(2^{\frac{1}{n}} - 1) \) needs to be true.
Utilization test:

\[ U = \displaystyle\sum_{i = 1}^{n} \frac{C_{i}}{T_{i}} = \frac{5}{20} + \frac{10}{30} +
\frac{15}{50} = \frac{53}{60} \approx 0.8833\]
\[ n(2^{\frac{1}{n}} - 1) = 3(2^{\frac{1}{3}}-1) \approx 0.7798 \]
\[ 0.8833 \nleq 0.7798 \]
The test fails, so we do not know if the task set is schedulable.

\subsection{Response-time analysis}
\label{sec-4-3}
\subsubsection{Task c}
\label{sec-4-3-1}
\[ w_0 = 5 \]
\begin{equation}
\label{eq:c}
R_c = 5 \leq 20
\end{equation}

\subsubsection{Task b}
\label{sec-4-3-2}
\[w_0 = 10 \]
\[w_1 = 10 + \left \lceil \frac{10}{20} \cdot 5 \right \rceil = 15 \]
\[w_2 = 10 + \left \lceil \frac{15}{20} \cdot 5 \right \rceil = 15 \]
\begin{equation}
\label{eq:b}
R_b = 15 \leq 30
\end{equation}

\subsubsection{Task a}
\label{sec-4-3-3}
\[ w_0 = 15 \]
\[ w_1 = 15 + \left \lceil \frac{15}{30} \cdot 10 \right \rceil + \left \lceil \frac{15}{20} \cdot 5 \right \rceil = 30 \]
\[ w_2 = 15 + \left \lceil \frac{30}{30} \cdot 10 \right \rceil + \left \lceil \frac{30}{20} \cdot 5 \right \rceil = 35 \]
\[ w_3 = 15 + \left \lceil \frac{35}{30} \cdot 10 \right \rceil + \left \lceil \frac{35}{20} \cdot 5 \right \rceil = 45 \]
\[ w_4 = 15 + \left \lceil \frac{45}{30} \cdot 10 \right \rceil + \left \lceil \frac{45}{20} \cdot 5 \right \rceil = 50 \]
\[ w_5 = 15 + \left \lceil \frac{50}{30} \cdot 10 \right \rceil + \left \lceil \frac{50}{20} \cdot 5 \right \rceil = 50 \]

\begin{equation}
\label{eq:a}
R_a = 50 \leq 50
\end{equation}

From (\ref{eq:c}), (\ref{eq:b}) and (\ref{eq:a}) we can conclude that the task set is schedulable.
The reason that the results from task 2 and this one are in disagreement is because the utilization test is only sufficient, not necessary. However, the response-time analysis is both sufficient and necessary.
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
